fixed readme
